"""Напишите программу, которая принимает на вход координаты двух точек и
находит расстояние между ними в 2D пространстве.

Пример:

    - A (3,6); B (2,1) -> 5,09
    - A (7,-5); B (1,-1) -> 7,21"""
#
# ax = int(input("Введите координату Х первой точки: "))
# ay = int(input("Введите координату Y первой точки: "))
# bx = int(input("Введите координату Х второй точки: "))
# by = int(input("Введите координату Y второй точки: "))
# print(round(((bx - ax)**2 + (by - ay)**2)**(1 / 2), 3))

ax, ay = (float(i) for i in input("Введите координаты А: ").split())
bx, by = (float(i) for i in input("Введите координаты В: ").split())
print(round(((bx - ax)**2 + (by - ay)**2)**(1 / 2), 3))

